Revit 2027 API
UnitTypeId.MeganewtonsPerMeter Property
 Meganewtons per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MeganewtonsPerMeter { get; }
Public Shared ReadOnly Property MeganewtonsPerMeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MeganewtonsPerMeter {
	ForgeTypeId^ get ();
}
static member MeganewtonsPerMeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace